#include <iostream> // сама€ обычна€ библиотека котора€ сразу при создание проекта по€вл€етс€
#include <vector> // это библиотека с помощью коорый мы можем сделать массив который сам по себе может раст€гиватс€
#include <conio.h> // банальнна€ библиотека котора€ нужна дл€ того 

using namespace std;

#include "FontAbstract.h" // наш абстрактный клас шрифта
#include "Doom.h" // один из шрифтов
#include "Lean.h" // второй из шрифтов
#include "DataBaseWords.h" // хранитель всех загаданных слов
#include "Word.h" // слово которое по кд вводит пользователь
